Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཏིང་ངེ་འཛིན་གྱི་རི་རབ་མངོན་པར་འཕགས་པའི་ཡེ་ཤེས་ཤེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Samādhi­mervabhyudgata­jñāna who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བའི་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Ratna­candra­dhvaja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྐུ་འོད་འཕྲོ་བའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Arcirmaṇḍala­gātra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཆོག་གི་འོད་ཀྱི་གཟི་བརྗིད་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Ratnāgra­prabha­tejas who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་ཀུན་ཏུ་ཐོགས་པ་མེད་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Samanta­jñāna­caryāvilamba who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་འོད་འཕྲོ་རྒྱ་མཚོའི་སྒོའི་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Arciḥ­samudra­mukha­vega­pradīpa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་གཞལ་མེད་ཁང་གི་དབྱངས་ཀྱི་རྒྱན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Dharma­vimāna­nirghoṣa­rāja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མི་མཚུངས་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Asadṛśa­guṇa­kīrti­dhvaja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཕྱག་རབ་ཏུ་བརྐྱང་པ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Pralambabāhu who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་སྔོན་གྱི་སྨོན་ལམ་གྱི་འཕྲུལ་པའི་ཟླ་བ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Pūrva­praṇidhi­nirmāṇa­candra who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ནམ་མཁའི་ཡེ་ཤེས་དོན་གྱི་སྒྲོན་མ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Ākāśa­jñānārtha­pradīpa who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱིས་འཕགས་པའི་ནམ་མཁའི་དབང་ཕྱུག་ཅེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Dharmodgata­nabheśvara who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དཔལ་གྱི་སྙིང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Vairocana­śrī­garbha­rāja who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་མཐུ་བོ་ཆེའི་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Dharma­nārāyaṇa­ketu who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Jñānaketu who appeared in the world.

source: དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་མཚོའི་པད་མོ་ཞེས་བྱ་བ་བསྙེན་བཀུར་ཏོ། །
en: “Subsequently, we served the tathāgata named Dharma­sāgara­padma who appeared in the world.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྩོགས་པ་འཇིག་རྟེན་གྱི་ཁམས་དེར་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་བྱུང་སྟེ། དེ་དག་ཐམས་ཅད་ཁོ་མོ་ཅག་གིས་ན་བཟའ་དང་། བཤོས་དང་།
en: “Noble one, those and other tathāgatas numbering altogether sixty sextillion appeared in that world realm.

source: གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་ཀྱིས་བསྙེན་བཀུར་ཏོ། །རིམ་གྲོར་བྱས་སོ། །བསྟི་སྟང་དུ་བྱས་སོ། །ཕུ་དུད་དུ་བྱས་སོ། །
en: I served them all with clothing, food, alms, bedding, medicine during times of illness, and necessary articles, showed them respect, honored them, venerated them, and made offerings to them.

source: མཆོད་དོ། །རིགས་ཀྱི་བུ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་ཐ་མར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡང་དག་པར་འབྱུང་བའི་གཟི་བརྗིད་ཅེས་བྱ་བ་བྱུང་སྟེ།
en: “Noble one, the last of those sixty hundred thousand trillion buddhas was the Tathāgata Arhat Samyak­saṃbuddha Vipula­dharmādhimukti­saṃbhava­tejas.

source: བཅོམ་ལྡན་འདས་དེ་གྲོང་ཁྱེར་དུ་གཤེགས་པ་ལ་ཁོ་མོ་རྒྱལ་པོའི་ཆུང་མར་གྱུར་ཏེ།
en: When that tathāgata came to the city, I was the king’s wife.

source: ཁྱིམ་ཐབ་དང་བཅས་པས་དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་མཆོད་པའི་སྒོ་རྣམ་པ་ཐམས་ཅད་དུ་བཤམས་པས་མཆོད་པ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེ་ལས་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་སྐྱེ་བ་འབྱུང་བའི་སྒྲོན་མ་ཞེས་བྱ་བ་ཐོས་སོ། །
en: Together with householders, we practiced the gateways of every kind of offering, and after making offerings with the offerings for a tathāgata, we heard from that bhagavat the Dharma teaching called The Lamp of the Arising of the Births of All the Tathāgatas.

source: དེ་ཐོས་ནས་ཁོ་མོས་ཡེ་ཤེས་ཀྱི་མིག་རབ་ཏུ་ཐོབ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་འདི་ཡང་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ།
en: On hearing that, I attained the eyes of wisdom, and I attained this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྣམ་པར་ཐར་བ་འདི་ལ་སྒོམ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་དང་ལྷན་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱོད་ཅིང་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་རྒྱུ་རྒྱུ་སྟེ།
en: “Noble one, meditating on this liberation, I practiced bodhisattva conduct together with the bodhisattva for kalpas as numerous as the atoms in a hundred thousand buddha realms.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་སྙེད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བསྐལ་པ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་ཞིག་བསྙེན་བཀུར་ནས།
en: During those kalpas as numerous as the atoms in that number of buddha realms, I served a vast extent of tathāgatas without end or middle.

source: བསྐལ་པ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་བ་བསྐལ་པར་བཞུགས་པ་གཅིག་ཀྱང་བསྙེན་བཀུར་ཏོ། །
en: In some kalpas, I served a single tathāgata who remained for an entire kalpa.

source: བསྐལ་པ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་གཉིས་ཀྱང་བསྙེན་བཀུར་ཏོ། །
en: In some kalpas, I served two tathāgatas.

source: བསྐལ་པ་ལ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་བརྗོད་དུ་མེད་པའི་བར་དག་ཀྱང་བསྙེན་བཀུར་ཏོ། །
en: In some kalpas, I served countless tathāgatas.

source: བསྐལ་པ་ལ་ལ་ལ་ནི་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱང་བསྙེན་བཀུར་ཏེ། དེ་སྲིད་དུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་ཡང་ཚད་ནི་ཇི་ཙམ་ཞིག །དབྱིབས་ནི་ཇི་ལྟ་བུ་ཞིག།
en: In some kalpas, I served as many tathāgatas as there are atoms in a buddha realm.

source: སྐུ་མདོག་ནི་ཅི་འདྲ་བ་ཞིག་ཡིན་པ་ཁོང་དུ་ཆུད་དོ། །
en: “During that time, my bodhisattva bodies’ sizes, shapes, and colors were beyond comprehension.

source: སྐུའི་ཕྲིན་ལས་ཀྱང་ཁོང་དུ་མ་ཆུད།
en: The activities of my bodies were beyond comprehension.

source: གསུང་གི་ཕྲིན་ལས་དང་ཐུགས་ཀྱི་ཕྲིན་ལས་ཀྱང་ཁོང་དུ་མ་ཆུད་དོ། །
en: The activities of my speech and of my mind were beyond comprehension.

source: ཡེ་ཤེས་ཀྱི་གཟིགས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་། ཡེ་ཤེས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་ཡང་ཁོང་དུ་མ་ཆུད་དོ། །
en: My wisdom’s sight, my wisdom’s range of activity, and the scope of my wisdom’s samādhi were also beyond comprehension.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པ་མཐོང་ནས། བྱང་ཆུབ་སེམས་དཔལ་ལ་དགའ་བའི་སེམས་སྐྱེས་ཏེ། བརྡ་སྣ་ཚོགས་དང་བསྙེན་པ་སྣ་ཚོགས་ཀྱིས་མོས་པ་བསྐྱེད་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཐབས་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བཟུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དུ་གྱུར་རོ། །
en: “Noble one, when beings see a bodhisattva and the practice of bodhisattva conduct, they admire the bodhisattva and with various gestures and approaches are attracted to the bodhisattva who cares for them through various worldly and nonworldly ways, so that they became the bodhisattva’s followers.

source: དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ་འཁོར་དུ་འགྲོགས་འགྲོགས་པས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མྱི་ལྡོག་པར་གྱུར་ཏོ། །
en: When they accompany as followers the bodhisattva who practices bodhisattva conduct, they become irreversible in their progress to the highest, complete enlightenment.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་ཆོས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་ཡང་དག་པར་འབྱུང་བའི་གཟི་བརྗིད་ཀྱི་ཞལ་མཐོང་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་འདི་ཐོབ་ནས།
en: “Noble one, in that way, as soon as I saw the Tathāgata Vipula­dharmādhimukti­saṃbhava­tejas, I attained this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas.

source: རྣམ་པར་ཐར་པ་འདི་སྒོམ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་དང་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་འགྲོགས་འགྲོགས་ཏེ།
en: Meditating on this liberation, I accompanied the bodhisattva for kalpas as numerous as the atoms in a hundred buddha realms.

source: བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བྱུང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་བསྙེན་བཀུར་ཏོ། །མཆོད་དོ་རིམ་གྲོར་བྱས་སོ། །
en: I served, made offerings to, and venerated all the tathāgatas that appeared during those kalpas as numerous as the atoms in buddha realms.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་ཆོས་བསྟན་པ་ཐོས་ཏེ། ཡོངས་སུ་བླངས་སོ། །ཡང་དག་པར་གཟུང་ངོ་། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཐམས་ཅད་ལས་ཀྱང་ཁོ་མོས་རྣམ་པར་ཐར་པ་འདི་ཚུལ་སྣ་ཚོགས་དང་། མདོ་སྡེའི་ཚུལ་གྱི་གསུང་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་རང་བཞིན་སྣ་ཚོགས་དང་།
en: I heard the teaching of the Dharma from all those tathāgatas, obtaining it and keeping it.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྣ་ཚོགས་དང་། རྣམ་པར་ཐར་པའི་རྒྱུད་སྣ་ཚོགས་དང་། དུས་ལ་འཇུག་པ་སྣ་ཚོགས་དང་། ཞིང་རྒྱ་མཚོ་ལ་འཇུག་པ་སྣ་ཚོགས་དང་། སངས་རྒྱས་བལྟ་བ་རྒྱ་མཚོ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་འཇུག་པ་སྣ་ཚོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོའི་ཚུལ་གྱི་ལམ་སྣ་ཚོགས་དང་།
en: I also obtained from all those buddha bhagavats this liberation through various ways, through various teachings of the ways of the sūtras, through various natures of liberation, through various entrances to liberation, through various practices of liberation, through various engagements in times, through various entries into realms, through various perceptions of oceans of visions of buddhas, through various entries into the circles of followers of tathāgatas, through various paths of the ways of oceans of bodhisattva prayers, through various accomplishments of bodhisattva conduct, and through various vast extents of bodhisattva liberations.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པ་སྣ་ཚོགས་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འབྱམ་ཀླས་པ་སྣ་ཚོགས་ཀྱིས་ཐོབ་པར་གྱུར་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཀུན་ཏུ་བཟང་པོའི་ཚུལ་ནི་ཁོང་དུ་མ་ཆུད་དོ། །
en: However, I still had not realized the way of completely good bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་ནི་ནམ་མཁའི་དབྱིངས་ཀྱིས་ཀླས་པར་ཚད་མྱེད་དོ། །སེམས་ཅན་གྱི་མིང་དུ་བྱ་བ་ཐམས་ཅད་ཀྱི་དབྱིངས་ལྟར་ཚད་མྱེད་དོ། །དུས་གསུམ་གྱི་རྒྱུད་རྒྱ་མཚོའི་དབྱིངས་ལྟར་ཚད་མེད་དོ། །ཕྱོགས་རྒྱ་མཚོའི་དབྱིངས་ལྟར་ཚད་མེད་དོ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོའི་དབྱིངས་ལྟར་ཚད་མེད་དོ། །
en: Because the way of the liberation of completely good bodhisattvas is as immeasurable as the extent of space, as immeasurable as the extent of the conceptualizations of beings, as immeasurable as the extent of the ocean of the divisions of the three times, as immeasurable as the extent of the ocean of the directions, and as immeasurable as the extent of the ocean of the ways of the realm of phenomena.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པའི་ཚུལ་གྱི་ལུས་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་དང་མཉམ་པའོ། །
en: “Noble one, the nature of the way of the liberations of the completely good bodhisattvas is the same as the scope of perception of the tathāgatas.

source: དེ་ལྟར་རིགས་ཀྱི་བུ་ཁོ་མོས་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་ལ་ལྟ་ལྟ་ཡང་བལྟ་བས་མ་ངོམས་ཏེ།
en: “In that way, noble one, for kalpas as numerous as the atoms in buddha realms I gazed again and again upon the bodhisattva’s body without ever having enough of seeing it.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གཅིག་ཏུ་འདོད་ཆགས་ལ་སྤྱོད་པའི་སྐྱེས་པ་དང་བུད་མེད་ཕན་ཚུན་ནས་ཕྲད་བར་དུས་བྱས་པ་གཉིས་ལ་ནི་སེམས་ཀྱི་རྒྱུད་ཚུལ་བཞིན་མ་ཡིན་པ་ཡིད་ལ་བྱེད་པ་ལས་བྱུང་བ་གཙང་བའི་འདུ་ཤེས་དང་། རྣམ་པར་རྟོག་པས་མྱོས་པ་ལས་བྱུང་བ་ཚད་མྱེད་པ་ཞིག་སྐྱེའོ། །
en: “Noble one, it was like when a man and woman have arranged to come together purely for the enjoyment of passion, and there arises an immeasurable development of their state of mind through their being intoxicated by the concepts and thoughts of purity that arise from fallacious mental activity.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་སྐུ་ལ་ལྟ་ན་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྒྱུད་འབྱམ་ཀླས་པ་མཐའ་དང་དབུས་མེད་པ་ཚད་མེད་པར་ཤིན་ཏུ་བསྟན་པ་གཞི་སྣ་ཚོགས་དང་ལྡན་པ། མཚམས་ཀྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ་དབྱིབས་སྣ་ཚོགས་དང་ལྡན་པ་རིའི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་སའི་གཞིའི་རྒྱན་སྣ་ཚོགས་བསྟན་དུ་ཡོད་པ་སྤྲིན་སྣ་ཚོགས་དང་ལྡན་པའི་ནམ་མཁའ་ཀུན་ནས་ཁྱབ་པའི་རྒྱན་དང་ལྡན་པ།
en: “Noble one, in the same way, when I looked upon the bodhisattva’s body, in each instant of mind, from each pore there appeared to my eyes an immeasurable vast extent of groups of world realms without end or middle, with various grounds, various arrays of borders, various shapes, various arrays of mountains, various displays of arrays of grounds, various skies adorned by coverings of clouds, various natures, names, and numbers, and various appearances of buddhas and successions of tathāgatas, adorned by various bodhimaṇḍas, with various miraculous manifestations of the turning of the Dharma wheel by tathāgatas, with various arrays of the circles of followers of tathāgatas, with the various sounds of the teaching of the various ways of the sūtras, with the various accomplishments of the ways of the yānas, with the various illuminations from pure lights and radiances, and with omens that have never been seen before.

source: ཚུལ་དང་མྱིང་དང་གྲངས་སྣ་ཚོགས་སུ་བརྗོད་པ་སངས་རྒྱས་འབྱུང་བ་དང་དེ་བཞིན་གཤེགས་པའི་རྒྱུད་སྣ་ཚོགས་འབྱུང་བ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: “From each pore there appeared to my eyes oceans of buddhas without end or middle.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྒྱན་སྣ་ཚོགས་དང་ལྡན་པ། མདོ་སྡེའི་ཚུལ་སྣ་ཚོགས་ཤིན་ཏུ་བསྟན་པའི་སྒྲ་འབྱུང་བ། ཐེག་པའི་ཚུལ་སྣ་ཚོགས་མངོན་པར་བསྒྲུབ་པ་འབྱུང་བ་དང་ལྡན་པ། ཡོངས་སུ་དག་པའི་འོད་དང་སྣང་བ་སྣ་ཚོགས་ཀྱི་རབ་ཏུ་སྣང་བ་མཚན་མ་སྔན་ཆད་མ་མཐོང་བ་དག་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་མྱིག་ལམ་དུ་སྣང་ངོ་། །བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་རྒྱན་སྣ་ཚོགས་མངའ་བ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་དང་ལྡན་པ་མདོ་སྡེའི་ཚུལ་སྣ་ཚོགས་སྒྲོག་པའི་རྣམ་པར་འཕྲུལ་པ་དང་ལྡན་པ་དག་ཀྱང་རྒྱུན་མི་འཆད་པའི་ཚུལ་དུ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་མྱིག་ལམ་དུ་སྣང་ངོ་། །
en: In each instant of mind, from each pore, there appeared continuously to my eyes the adornment of various bodhimaṇḍas, the miraculous manifestations of the various turnings of the Dharma wheel, and the miraculous manifestations of the sounds of the various ways of the sūtras.

source: བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སེམས་ཅན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ཁྱིམ་དང་ཀུན་དགའི་ར་བ་དང་རི་དང་གཞལ་མེད་ཁང་དང་ཆུ་ཀླུང་དང་རྒྱ་མཚོ་ལ་གནས་པ་གཟུགས་དང་ལུས་སྣ་ཚོགས་ཅན་ལོངས་སྤྱོད་ཀྱི་ཡུལ་སྣ་ཚོགས་དང་ལྡན་པ། སྤྱོད་པ་དང་སྤྱོད་ཡུལ་དང་སྦྱོར་བ་སྣ་ཚོགས་དང་ལྡན་པ།
en: “In each instant of mind, from each pore, there appeared to my eyes a vast ocean of beings without end or middle, with houses, parks, divine palaces, rivers, oceans, and dwellings, with various forms and bodies, with various ranges of enjoyments, with various engagements in conduct and behavior, and with various forms of perfections of faculties.

source: དབང་པོ་སྣ་ཚོགས་སུ་བསྒྲུབ་པའི་ཚུལ་དང་ལྡན་པ་དག་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་མྱིག་ལམ་དུ་སྣང་ངོ་། །བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་དུས་གསུམ་རྒྱ་མཚོ་ལ་འཇིག་པའི་ཚུལ་མཐའ་དང་དབུས་མེད་པ་ཞིག་མིག་ལམ་དུ་སྣང་ངོ་། །
en: “From each pore there appeared to my eyes ways of entering an ocean of the three times, without end or middle.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ཞིག་ནི་རྣམ་པར་དག་པར་འགྱུར་རོ། །
en: “An ocean, without end or middle, of bodhisattva prayers were purified.

source: བྱང་ཆུབ་སེམས་དཔའི་སའི་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་། །
en: “There appeared an ocean, without end or middle, of different forms of conduct of the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཚུལ་རྒྱ་མཚོ་ཡོངས་སུ་དག་པ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་། །
en: “There appeared a pure ocean, without end or middle, of the perfections of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྦྱོར་བ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་། །
en: “There appeared an ocean, without end or middle, of the past practices of the bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་། །
en: “There appeared an ocean, without end or middle, of the ways of purifying buddha realms.

source: བྱང་ཆུབ་སེམས་དཔའི་བྱམས་པ་ཆེན་པོའི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་སྣང་ངོ་། །
en: “There appeared an ocean, without end or middle, of the ways of the great love of bodhisattvas.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་གདུལ་བའི་མཐུ་དང་ཐབས་རྒྱ་མཚོ་དག་ལའང་འཇུག་ཅིང་ཁོང་དུ་ཆུད་དོ།
en: “I comprehended their entering oceans of the power and methods for ripening and guiding all beings.

source: བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་གྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་ཡོངས་སུ་འགྲུབ་བོ། །
en: “They accomplished an ocean, without end or middle, of the ways of the clouds of the great compassion of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་དགའ་བའི་ཤུགས་ཆེན་པོ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་རྣམ་པར་འཕེལ་ཏེ།
en: “They increased an ocean, without end or middle, of the great power of the joy of bodhisattvas.

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་དག་ཀྱང་རབ་ཏུ་འགྲུབ་བོ། །
en: “In each instant of mind, they accomplished an ocean, without end or middle, of the methods of gathering all beings.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་བསྐལ་བ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་བ་སྤུའི་སྒོ་རེ་རེ་ཞིང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་ཏེ།
en: “Noble one, in that way, for kalpas as numerous as the atoms in a hundred buddha realms, in each instant of mind I perceived and comprehended an ocean, without end or middle, of the ways of the Dharma in each pore of the bodhisattva.

source: ཁོང་དུ་ཆུད་པར་བྱས་ཀྱང་མཐར་ཐུག་པར་མ་གྱུར་ཏེ་སྔོན་ཁོང་དུ་ཆུད་པ་ལ་བཟླས་ཏེ། ཁོང་དུ་ཆུད་པར་བྱས་པའང་མེད་དོ་སྔོན་ཐོས་པ་ལ་བཟླས་ཏེ། ཐོས་བར་བྱ་བའང་མེད་དོ། །
en: Nevertheless, I did not comprehend them in their entirety, even though I never perceived again what I had perceived before, even though I did not hear again what I had already heard before.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དོན་ཐམས་ཅད་གྲུབ་པ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་ཤིང་བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་བཞུགས་པའི་ཚེའང་ཁོ་མོ་ནི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་དུས་གསུམ་གྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པའི་ཚུལ་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པར་བྱ་བས་ཡོངས་སུ་འཇུག་གོ །
en: “Noble one, in that way, when I was in the harem of Sarvārtha­siddha, who had an entourage of a crowd of queens, through an ocean of the ways of comprehending the realm of phenomena I perceived in each of his pores an ocean, without end or middle, of the ways of the three times.

source: རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བུའི་ཡུལ་འདི་ཤེས་ཏེ།
en: “Noble one, I know and practice only this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas.

source: མཉམ་པར་གཞོག་པར་ཟད་ན་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ཀྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་པ་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་ཞིང་འདྲ་བའི་དབྱིངས་སུ་གནས་པའི་ལུས་རྣམ་པར་དམིགས་པ་ཡོངས་སུ་སྟོན་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་མ་མཐུན་པར་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ཁ་དོག་མཐའ་ཡས་པའི་སྤྲུལ་པའི་སྤྲིན་རབ་ཏུ་འགྱེད་པ་ལུས་མེད་པའི་ཆོས་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་ཤིན་ཏུ་རྣམ་པར་དག་པ་ནམ་མཁའི་མཚན་ཉིད་དུ་འགྲོ་བའི་རང་བཞིན་ཁོང་དུ་ཆུད་པས་རྣམ་པ་རྟོག་པ་མེད་པ་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བའི་བློ་རྣམ་པར་གདོན་མི་ཟ་བས་དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་རྣམ་པར་འཕྲུལ་པ་ལ་བརྩོན་པ་རྣམ་པར་ཐར་པའི་ཡུལ་མཐའ་དང་དབུས་མེད་པས་རྣམ་པར་འཕྲུལ་པ་ལ་ཞུགས་པ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་རྒྱ་ཆེན་པོར་སེམས་བསྐྱེད་པས་འཇུག་པ་ལ་རྣམ་པར་སྤྱོད་ཅིང་དབང་བསྒྱུར་བ་ཆོས་ཀྱི་གནས་སྒོ་ཐམས་ཅད་དང་ལྡན་པའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོ་ལ་རྣམ་པར་རྩེ་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ་ཡོན་ཏན་གྱི་གཏེར་མ་ལུས་པར་བསྟན་པར་ནུས་རེ་སྐན། །
en: How could I know the conduct, or teach the treasure of qualities, without exception, of the bodhisattvas who engage in an ocean, without end or middle, of the ways of methods; who manifest the perception of bodies in shapes that accord with those of all beings; who manifest conducts that accord with the aspirations of all beings; who emit clouds of emanations with infinite colors from all their pores; who have the realization, free of thought, of the pure nature of the bodyless essence of the true nature, a nature that has the characteristics of space; who with the certainty of realization at all times are dedicated to miraculous manifestations equal to those of the tathāgatas; who engage in miraculous manifestation through the scope of the liberations, which has no end or middle; who through the generation of motivation have power over entering and remaining in the vast realm of the Dharma; and who revel in an ocean of liberations that possess all the gateways into the levels of the Dharma?

source: སོང་རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ཞབས་ཀྱི་དྲུང་འདི་ཉིད་ན་ཁྲི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སཱིང་མོའི་སྙིང་པོ་ཅན་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་ལྷ་མོ་སྒྱུ་མ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་དྲི་མ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་ཡིན་པ་དང་།
en: “Depart, noble one. Here at the feet of the Bhagavat Vairocana, upon a precious throne with various adornments that has in its center a lotus made of the kings of precious jewels, is the mother of the bodhisattva, whose name is Māyādevī. Go to her and ask her, ‘How are bodhisattvas who practice bodhisattva conduct undefiled by any of the stains of this world? How do bodhisattvas have an uninterrupted dedication to making offerings to the tathāgatas?

source: དེ་བཞིན་གཤེགས་པ་མཆོད་པའི་ནན་ཏན་ལ་རྒྱུན་མི་ཆད་པ་ཡིན་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་མཐའ་ཐམས་ཅད་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་པ་དང་།
en: How are bodhisattvas irreversible from attaining the final accomplishment of their activities?

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ལ་འཇུག་པ་ལ་སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་བ་ཡིན་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་ཡིན་པ་དང་།
en: How are they free from obscurations in their entry into bodhisattva liberations? How are they without expectation of a reward from others in all their bodhisattva conduct?

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མངོན་དུ་གྱུར་པར་གནས་པ་ཡིན་པ་དང་།
en: How do they have the direct perception of all the tathāgatas?

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ནན་ཏན་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་པ་དང་།
en: How do they never lapse from their dedication to gathering all beings?

source: ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལ་གནས་པར་བྱ་བ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་པ་དང་།
en: How do they never lapse from remaining in all bodhisattva conduct until the last future kalpa?
